Posting-Up/PICO2-MCU-PROGRAMMER/MC9S08PA4.c
/* -------------------------------------------------------------------------- */
/*                                  Headers                                   */
/* -------------------------------------------------------------------------- */
#include <stdio.h>
#include <string.h>
#include "pico/stdlib.h"
#include "tx_byte.pio.h"
#include "rx_byte.pio.h"
#include "MC9S08PA4.h"


/* -------------------------------------------------------------------------- */
/*                                  Handlers                                  */
/* -------------------------------------------------------------------------- */
/**
 * DESCRIPTION: Loads the TX/RX PIO programs and hands the BKGD pin to the TX state machine
 * INPUT:           ---
 * RETURN:          ---
 */
void S08_PIO_INIT(void)
{
    TX_BYTE_OFFSET = pio_add_program(TX_BYTE_PIO, &tx_byte_program);
    RX_BYTE_OFFSET = pio_add_program(RX_BYTE_PIO, &rx_byte_program);

    tx_byte_program_init(TX_BYTE_PIO, TX_BYTE_SM, TX_BYTE_OFFSET, PIN_BKGD, 32);
    rx_byte_program_init(RX_BYTE_PIO, RX_BYTE_SM, RX_BYTE_OFFSET, PIN_BKGD);

    tx_byte_claim_pin(TX_BYTE_PIO, TX_BYTE_SM, TX_BYTE_OFFSET, PIN_BKGD);
}

/**
 * DESCRIPTION: Power Cycle MCU
 * INPUT:           ---
 * RETURN:          ---
 */
static void S08_POWER_CYCLE(void)
{
    gpio_put(PIN_VDD_DISABLE, 1);
    sleep_ms(100);
    gpio_put(PIN_VDD_DISABLE, 0);
    sleep_ms(100);
}

/**
 * DESCRIPTION: (A) Enters Active Background (B) Sends SYNC (C) Determines BDC clock
 * INPUT:           ---
 * RETURN:      1 BDC Clock (nanoseconds)
 */
static uint64_t S08_CMD_SYNC(void)
{
    // (1) Initialize GPIO
    gpio_init(PIN_VDD_DISABLE);
    gpio_init(PIN_RESET);
    gpio_init(PIN_BKGD);

    gpio_set_dir(PIN_VDD_DISABLE, GPIO_OUT);
    gpio_set_dir(PIN_RESET, GPIO_OUT);
    gpio_set_dir(PIN_BKGD, GPIO_OUT);

    // (2) POWER - "OFF"
    // (3) Pull RESET & BKGD Pin LOW
    gpio_put(PIN_VDD_DISABLE, 1);
    gpio_put(PIN_RESET, 0);
    gpio_put(PIN_BKGD, 0);

    sleep_ms(100);

    // (4) POWER - "ON"
    gpio_put(PIN_VDD_DISABLE, 0);
    sleep_ms(10);

    // (5) RESET - "HIGH"
    gpio_put(PIN_RESET, 1);
    sleep_ms(10);

    // (6) BKGD - "HIGH" for 20 us
    gpio_put(PIN_BKGD, 1);
    sleep_us(20);

    // (6) BKGD - "LOW" for 32 us
    gpio_put(PIN_BKGD, 0);
    sleep_us(32);

    // (7) Speed-up pulse
    gpio_put(PIN_BKGD, 1);
    gpio_set_dir(PIN_BKGD, GPIO_IN);

    // (7b) Arm SysTick @ 6.67 ns
    systick_hw->csr = 0;
    systick_hw->rvr = 0x00FFFFFFu;
    systick_hw->cvr = 0;            // any write clears the counter and reloads it from RVR
    systick_hw->csr = 0x5u;         // ENABLE | CLKSOURCE=processor clock, interrupt off

    // (8) Wait for target to pull BKGD LOW
    uint64_t START_TIMEOUT = time_us_64();
    while (gpio_get(PIN_BKGD)) 
    {
        if (time_us_64() - START_TIMEOUT > 10000) { // 10ms timeout
            printf("SYNC Error: Target failed to assert pulse.\n");
            return 0;
        }
    }

    // (9) Capture the start of the pulse
    uint32_t PULSE_START_TICKS = systick_hw->cvr;

    // (10) Wait for BKGD to go back HIGH
    uint64_t END_TIMEOUT = time_us_64();
    while (!gpio_get(PIN_BKGD)) 
    {
        if (time_us_64() - END_TIMEOUT > 10000) { // 10ms timeout
            printf("SYNC Error: Target failed to release pulse.\n");
            return 0;
        }
    }

    // (10) Capture the exact end of the pulse
    uint32_t PULSE_END_TICKS = systick_hw->cvr;

    // (11) Measure and print Sync pulse
    uint32_t PULSE_TICKS   = (PULSE_START_TICKS - PULSE_END_TICKS) & 0x00FFFFFFu;
    uint64_t TICKS_PER_BDC = (uint64_t)SM_MHZ * 128ULL;
    uint64_t BDC_CLOCK_NS  = (((uint64_t)PULSE_TICKS * 1000ULL) + (TICKS_PER_BDC / 2ULL)) / TICKS_PER_BDC;

    printf("BDC clk=%llu ns/cycle\n", (unsigned long long)BDC_CLOCK_NS);

    // (11) Return 1 BDC Clock (in nanoseconds)
    return BDC_CLOCK_NS;
}

/**
 * DESCRIPTION: Writes 1 byte to MCU
 * INPUT:       [pio] Destination PIO block  [sm] Target state machine              [low/high_cycles] Timing limits
 *              [cmd] 8-bit command          [address] 16-bit target memory offset  [data] 8-bit write payload
 * RETURN:          ---
 */
static inline void S08_TX_BYTE(PIO pio, uint sm, uint32_t low_cycles, uint32_t high_cycles, uint8_t cmd, uint16_t address, uint8_t data)
{
    uint32_t packet = ((uint32_t)cmd << 24) | ((uint32_t)address << 8) | (uint32_t)data;

    tx_byte_load_timing(pio, sm, low_cycles, high_cycles);
    tx_byte_send(pio, sm, packet, 32);
}

/**
 * DESCRIPTION: Reads 1 byte from MCU
 * INPUT:       [pio] Destination PIO block  [sm] Target state machine              [low/high_cycles] Timing limits
 *              [cmd] 8-bit command          [address] 16-bit target memory offset
 * RETURN:      8-bit read payload
 */
static inline uint8_t S08_RX_BYTE(PIO pio, uint sm, uint32_t low_cycles, uint32_t high_cycles, uint8_t cmd, uint16_t address)
{
    // Pack 8-bit command (bits 23:16) and 16-bit address (bits 15:0) into a 24-bit package
    uint32_t packet = ((uint32_t)cmd << 16) | (uint32_t)address;

    // Load transmission timing configurations and dispatch the 24-bit header out to the wire
    tx_byte_load_timing(pio, sm, low_cycles, high_cycles);
    tx_byte_send(pio, sm, packet, 24);

    // Wait for outbound frame to clear the wire and safely disable TX state machine
    tx_byte_wait_idle(pio, sm);
    pio_sm_set_enabled(pio, sm, false);

    // Seize bus control and shift ownership over to the RX state machine
    rx_byte_claim_pin(RX_BYTE_PIO, RX_BYTE_SM, RX_BYTE_OFFSET, PIN_BKGD);

    // Stream out dynamic loop clocks per bit and capture the incoming data payload
    uint8_t data = rx_byte_receive(RX_BYTE_PIO, RX_BYTE_SM,
                                   RX_CMD_TO_DATA_DELAY_SM_CYCLES,
                                   RX_LOW_TIME_SM_CYCLES,
                                   RX_WAIT_TO_SAMPLE_TIME_SM_CYCLES,
                                   RX_FINISH_HIGH_TIME_SM_CYCLES);

    // Disable the RX engine and return line ownership back to the TX state machine
    pio_sm_set_enabled(RX_BYTE_PIO, RX_BYTE_SM, false);
    tx_byte_claim_pin(pio, sm, TX_BYTE_OFFSET, PIN_BKGD);

