Posting-Up/PICO2-MCU-PROGRAMMER/MC9S08PA4.c
    return data;
}

/**
 * DESCRIPTION: Converts target BDC clock cycles into state machine execution cycles
 * INPUT:       [target_cycles] Target cycle count  [BDC_CLK_NS] Calibrated clock in ns  [sm_mhz] PIO speed in MHz
 * RETURN:      Calculated state machine cycles (rounded to nearest integer)
 */
static uint16_t S08_CONVERT_TO_SM_CYCLES(uint16_t target_cycles, uint16_t BDC_CLK_NS, uint8_t sm_mhz)
{
    // Multiply target cycles by nanoseconds per cycle and PIO speed, then round to nearest integer via +500/1000
    return (uint16_t)((((uint64_t)target_cycles * BDC_CLK_NS * sm_mhz) + 500ULL) / 1000ULL);
}

/**
 * DESCRIPTION: Launches a staged NVM command (write 1 to FSTAT[CCIF]) and waits for completion
 * INPUT:           ---
 * RETURN:      Final FSTAT value (test against NVM_FSTAT_ERR_MASK for ACCERR/FPVIOL/MGSTAT)
 */
static uint8_t S08_NVM_LAUNCH_COMMAND(void)
{
    // (1) Launch the command by writing 1 to FSTAT[CCIF]
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FSTAT, NVM_FSTAT_CCIF);

    // (2) Read FSTAT until the CCIF bit (0x80) is set back to 1 (Command complete)
    uint8_t FSTAT = 0;
    do {
        FSTAT = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, NVM_FSTAT);
    } while ((FSTAT & NVM_FSTAT_CCIF) == 0); // Wait until CCIF == 1

    // (3) Hand the raw status back so the caller can report ACCERR / FPVIOL / MGSTAT
    return FSTAT;
}

/**
 * DESCRIPTION: Programs one 8-byte flash phrase (two longwords) with the Program Flash command
 * INPUT:       [address] Phrase base address, must be longword aligned  [data] 8 source bytes
 * RETURN:      Final FSTAT value (test against NVM_FSTAT_ERR_MASK)
 *
 */
static uint8_t S08_PROGRAM_FLASH_PHRASE(uint16_t address, const uint8_t* data)
{
    // (1) Clear any stale ACCERR / FPVIOL before starting the command write sequence (RM Figure 4-3)
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FSTAT, NVM_FSTAT_ERR_CLR);

    // (2) FCCOBIX = 0 : command opcode + global address [23:16]
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, 0);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, S08_PROGRAM_FLASH);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBLO, NVM_FLASH_GLOBAL_HI);

    // (3) FCCOBIX = 1 : global address [15:0] of the phrase
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, 1);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, (uint8_t)(address >> 8));
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBLO, (uint8_t)(address & 0xFFu));

    // (4) FCCOBIX = 2..5 : the four 16-bit program values, HI = lower address byte (big endian)
    for (uint8_t word = 0; word < 4u; word++)
    {
        S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, (uint8_t)(word + 2u));
        S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, data[(word * 2u) + 0u]);
        S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBLO, data[(word * 2u) + 1u]);
    }

    // (5) Launch and wait for CCIF
    return S08_NVM_LAUNCH_COMMAND();
}

/**
 * DESCRIPTION: Programs 1 to 4 EEPROM bytes with the Program EEPROM command
 * INPUT:       [address] First EEPROM byte address  [data] source bytes  [count] 1..4 bytes
 * RETURN:      Final FSTAT value (test against NVM_FSTAT_ERR_MASK)
 */
static uint8_t S08_PROGRAM_EEPROM_BYTES(uint16_t address, const uint8_t* data, uint8_t count)
{
    // (1) Clear any stale ACCERR / FPVIOL before starting the command write sequence (RM Figure 4-3)
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FSTAT, NVM_FSTAT_ERR_CLR);

    // (2) FCCOBIX = 0 : command opcode + global address [23:16]
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, 0);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, S08_PROGRAM_EEPROM);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBLO, NVM_EEPROM_GLOBAL_HI);

    // (3) FCCOBIX = 1 : global address [15:0] of the first byte
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, 1);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, (uint8_t)(address >> 8));
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBLO, (uint8_t)(address & 0xFFu));

    // (4) FCCOBIX = 2..(count+1) : one source byte per index. The index reached at launch is
    //     what tells the memory controller how many bytes to program.
    for (uint8_t byte = 0; byte < count; byte++)
    {
        S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, (uint8_t)(byte + 2u));
        S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, data[byte]);
        S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBLO, data[byte]);
    }

