Posting-Up/PICO2-MCU-PROGRAMMER/MC9S08PA4.c
    // (5) Launch and wait for CCIF
    return S08_NVM_LAUNCH_COMMAND();
}

/**
 * DESCRIPTION: Programs MC9S08PA4 MCU
 * INPUT:           ---
 * RETURN:      True=SUCCESS, False=FAILURE
 */
bool PROGRAM_MC9S08PA4(const S19Packet_t* buffer, size_t total_packets)
{
    /* -------------------------------------------------------------------------- */
    /*           (1) BDM Entry and determine 1 BDC Clk from SYNC pulse            */
    /* -------------------------------------------------------------------------- */
    uint16_t BDC_CLK_NS = S08_CMD_SYNC();


    /* -------------------------------------------------------------------------- */
    /*           (2) Calculate tx_bit and rx_bit pulsing metrics                  */
    /* -------------------------------------------------------------------------- */
    uint32_t irq_PROGRAM_STATUS         = save_and_disable_interrupts();

    uint16_t BDC_TIMING_NS = (uint16_t)(((uint32_t)BDC_CLK_NS * 108u + 50u) / 100u);           // +8% guard band

    // Map targets specified in BDC cycles to exact state machine cycle counts
    BIT_TIME_SM_CYCLES                  = S08_CONVERT_TO_SM_CYCLES(16, BDC_TIMING_NS, SM_MHZ); // 16 cycles
    TX_1_LOW_TIME_SM_CYCLES             = S08_CONVERT_TO_SM_CYCLES(3 , BDC_TIMING_NS, SM_MHZ); // 3  cycles
    TX_1_HIGH_TIME_SM_CYCLES            = S08_CONVERT_TO_SM_CYCLES(13, BDC_TIMING_NS, SM_MHZ); // 13 cycles
    TX_0_LOW_TIME_SM_CYCLES             = TX_1_HIGH_TIME_SM_CYCLES;                            // 13 cycles
    TX_0_HIGH_TIME_SM_CYCLES            = TX_1_LOW_TIME_SM_CYCLES;                             // 3  cycles
    RX_LOW_TIME_SM_CYCLES               = TX_1_LOW_TIME_SM_CYCLES - 1;                         // 3  cycles, less 1 SM cycle
    RX_WAIT_TO_SAMPLE_TIME_SM_CYCLES    = S08_CONVERT_TO_SM_CYCLES(7, BDC_TIMING_NS, SM_MHZ);  // 7  cycles
    RX_FINISH_HIGH_TIME_SM_CYCLES       = RX_WAIT_TO_SAMPLE_TIME_SM_CYCLES;                    // 7  cycles
    RX_CMD_TO_DATA_DELAY_SM_CYCLES      = BIT_TIME_SM_CYCLES;                                  // 16 cycles

    // Determine FDIV bits for FCLKDIV
    if (BDC_CLK_NS < 50 || BDC_CLK_NS > 1000)        // Out of safe range for Flash operations
    {
        restore_interrupts(irq_PROGRAM_STATUS);
        S08_POWER_CYCLE();
        return false;
    }
    else if (BDC_CLK_NS <= 51)   { FCLKDIV = 0x13; } // 19.6 MHz - 20.0 MHz
    else if (BDC_CLK_NS <= 53)   { FCLKDIV = 0x12; } // 18.6 MHz - 19.6 MHz
    else if (BDC_CLK_NS <= 56)   { FCLKDIV = 0x11; } // 17.6 MHz - 18.6 MHz
    else if (BDC_CLK_NS <= 60)   { FCLKDIV = 0x10; } // 16.6 MHz - 17.6 MHz
    else if (BDC_CLK_NS <= 64)   { FCLKDIV = 0x0F; } // 15.6 MHz - 16.6 MHz
    else if (BDC_CLK_NS <= 68)   { FCLKDIV = 0x0E; } // 14.6 MHz - 15.6 MHz
    else if (BDC_CLK_NS <= 73)   { FCLKDIV = 0x0D; } // 13.6 MHz - 14.6 MHz
    else if (BDC_CLK_NS <= 79)   { FCLKDIV = 0x0C; } // 12.6 MHz - 13.6 MHz
    else if (BDC_CLK_NS <= 86)   { FCLKDIV = 0x0B; } // 11.6 MHz - 12.6 MHz
    else if (BDC_CLK_NS <= 94)   { FCLKDIV = 0x0A; } // 10.6 MHz - 11.6 MHz
    else if (BDC_CLK_NS <= 104)  { FCLKDIV = 0x09; } //  9.6 MHz - 10.6 MHz
    else if (BDC_CLK_NS <= 116)  { FCLKDIV = 0x08; } //  8.6 MHz -  9.6 MHz
    else if (BDC_CLK_NS <= 131)  { FCLKDIV = 0x07; } //  7.6 MHz -  8.6 MHz
    else if (BDC_CLK_NS <= 151)  { FCLKDIV = 0x06; } //  6.6 MHz -  7.6 MHz
    else if (BDC_CLK_NS <= 178)  { FCLKDIV = 0x05; } //  5.6 MHz -  6.6 MHz
    else if (BDC_CLK_NS <= 217)  { FCLKDIV = 0x04; } //  4.6 MHz -  5.6 MHz
    else if (BDC_CLK_NS <= 277)  { FCLKDIV = 0x03; } //  3.6 MHz -  4.6 MHz
    else if (BDC_CLK_NS <= 384)  { FCLKDIV = 0x02; } //  2.6 MHz -  3.6 MHz
    else if (BDC_CLK_NS <= 625)  { FCLKDIV = 0x01; } //  1.6 MHz -  2.6 MHz
    else                         { FCLKDIV = 0x00; } //  1.0 MHz -  1.6 MHz

    restore_interrupts(irq_PROGRAM_STATUS);


    /* -------------------------------------------------------------------------- */
    /*                          (3) Write FCLKDIV                                 */
    /* -------------------------------------------------------------------------- */
    // Claim BKGD from SYNC
    tx_byte_claim_pin(TX_BYTE_PIO, TX_BYTE_SM, TX_BYTE_OFFSET, PIN_BKGD);
    // Write FDIV bits
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCLKDIV, FCLKDIV);


    /* -------------------------------------------------------------------------- */
    /*                          (4) Read Device ID                                */
    /* -------------------------------------------------------------------------- */
    uint8_t  SDIDH     = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, SYS_SDIDH);
    uint8_t  SDIDL     = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, SYS_SDIDL);
    uint16_t DEV_ID    = ((uint16_t)SDIDH << 8) | SDIDL;

    if ((DEV_ID & MC9S08PA4_DEV_ID_MASK) == MC9S08PA4_DEV_ID)
    {
        printf("Device ID = 0x%04X (part ID 0x%03X, silicon rev 0x%X)\n", DEV_ID, DEV_ID & MC9S08PA4_DEV_ID_MASK, DEV_ID >> 12);
    }
    else
    {
        printf("Device ID mismatch: expected 0x%03X\n", MC9S08PA4_DEV_ID);
        S08_POWER_CYCLE();
        return false;
    }

    /* -------------------------------------------------------------------------- */
    /*                          (5) Erase MCU                                     */
    /* -------------------------------------------------------------------------- */
    // (1) Reclaim BKGD pin for TX
    tx_byte_claim_pin(TX_BYTE_PIO, TX_BYTE_SM, TX_BYTE_OFFSET, PIN_BKGD);
    // (2) Disable FLASH & EEPROM protection.
    //     RM Table 4-16: an erase of all blocks is only possible when FPROT[FPOPEN], FPROT[FPHDIS]
    //     and EEPROT[DPOPEN] are set prior to launching the command.
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FPROT,  NVM_FPROT_UNPROTECT_ALL);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_EEPROT, NVM_EEPROT_UNPROTECT_ALL);

