Posting-Up/PICO2-MCU-PROGRAMMER/MC9S08PA4.c
    // (3) Clear any stale ACCERR / FPVIOL. While either flag is set, CCIF cannot be
    //     cleared and no new command can be launched (RM Figure 4-3, 4.5.2.4.2).
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FSTAT, NVM_FSTAT_ERR_CLR);

    // (4) Erase ALL blocks. RM Table 4-31: FCCOBIX = 000 with FCCOBHI = 0x08 only
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBIX, 0);
    S08_TX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_WRITE_BYTE, NVM_FCCOBHI, S08_ERASE_ALL_BLOCK);

    // (5) Launch (write 1 to FSTAT[CCIF]) and poll FSTAT until CCIF == 1 (Command complete)
    uint8_t FSTAT = S08_NVM_LAUNCH_COMMAND();

    // (6) Check for Flash errors (ACCERR = 0x20, FPVIOL = 0x10, MGSTAT[1:0] = 0x03)
    if (FSTAT & NVM_FSTAT_ERR_MASK)
    {
        // Handle Erase Error (Access Violation, Protection Violation or failed erase verify)
        printf("ERASE FAILED (FSTAT=0x%02X)\n", FSTAT);
        S08_POWER_CYCLE();
        return false;
    }

    printf("ERASE OK (all flash and EEPROM blocks)\n");


    /* -------------------------------------------------------------------------- */
    /*                          (6) Program FLASH                                 */
    /* -------------------------------------------------------------------------- */
    // (1) Build the merged flash and EEPROM images from the staged S19 packets
    memset(FLASH_IMAGE,  NVM_ERASED_BYTE, sizeof(FLASH_IMAGE));
    memset(EEPROM_IMAGE, NVM_ERASED_BYTE, sizeof(EEPROM_IMAGE));

    uint16_t lowest_flash  = NVM_FLASH_END;
    uint16_t highest_flash = NVM_FLASH_START;
    size_t   packets_used  = 0;

    for (size_t packet = 0; packet < total_packets; packet++)
    {
        uint16_t address = buffer[packet].address;
        uint16_t merged  = 0;

        for (uint16_t offset = 0; offset < S19_PAYLOAD_SIZE_BYES; offset++)
        {
            uint32_t target = (uint32_t)address + offset;
            uint8_t  source = buffer[packet].payload[offset];

            if ((target >= NVM_FLASH_START) && (target <= NVM_FLASH_END))
            {
                FLASH_IMAGE[target - NVM_FLASH_START] &= source;
                merged++;

                if (source != NVM_ERASED_BYTE)
                {
                    if ((uint16_t)target < lowest_flash)  { lowest_flash  = (uint16_t)target; }
                    if ((uint16_t)target > highest_flash) { highest_flash = (uint16_t)target; }
                }
            }
            else if ((target >= NVM_EEPROM_START) && (target <= NVM_EEPROM_END))
            {
                EEPROM_IMAGE[target - NVM_EEPROM_START] &= source;
                merged++;
            }
        }

        // (1a) Only anomalies are logged per packet - the record count can run into the hundreds
        if (merged == 0)
        {
            printf("SKIPPED packet @0x%04X (outside flash 0x%04X-0x%04X and EEPROM 0x%04X-0x%04X)\n",
                   address, NVM_FLASH_START, NVM_FLASH_END, NVM_EEPROM_START, NVM_EEPROM_END);
        }
        else
        {
            packets_used++;
        }
    }

    // (1b) Summarise the merged image. The flash span is the sanity check against a truncated
    //      stream: it must reach as high as the image is expected to go.
    printf("[PICO] Merged %zu of %zu packets; flash data spans 0x%04X-0x%04X\n",
           packets_used, total_packets, lowest_flash, highest_flash);

    // (2) Does the S19 image supply its own flash configuration field (0xFF78-0xFF7F)?
    //     Tested on the MERGED image, so a packet whose 0xFF padding merely reaches into the field
    //     does not count as the image owning the security byte. If it does own it, section (10)
    //     must not force its own value on top of an already programmed phrase.
    bool s19_covers_config_field = false;

    for (uint16_t address = NVM_CFG_FIELD_START; address <= NVM_CFG_FIELD_END; address++)
    {
        if (FLASH_IMAGE[address - NVM_FLASH_START] != NVM_ERASED_BYTE)
        {
            s19_covers_config_field = true;
        }
    }

    // (3) Program the image one 8-byte phrase at a time. Phrases that stayed fully erased carry no
    //     bits to clear, so they are left untouched (RM Table 4-27 note 1 alignment is automatic
    //     because the walk starts at the 0xF000 flash base).
    uint16_t PHRASES_PROGRAMMED = 0;

    for (uint16_t offset = 0; offset < NVM_FLASH_SIZE_BYTES; offset += NVM_FLASH_PHRASE_BYTES)
    {
        bool PHRASE_IS_ERASED = true;

        for (uint8_t byte = 0; byte < NVM_FLASH_PHRASE_BYTES; byte++)
        {
            if (FLASH_IMAGE[offset + byte] != NVM_ERASED_BYTE)
            {
                PHRASE_IS_ERASED = false;
                break;
            }
        }

        if (PHRASE_IS_ERASED)
        {
            continue;
        }

        uint16_t address = (uint16_t)(NVM_FLASH_START + offset);

        FSTAT = S08_PROGRAM_FLASH_PHRASE(address, &FLASH_IMAGE[offset]);

        if (FSTAT & NVM_FSTAT_ERR_MASK)
        {
            printf("PROGRAM FLASH FAILED @0x%04X (FSTAT=0x%02X)\n", address, FSTAT);
            S08_POWER_CYCLE();
            return false;
        }

        PHRASES_PROGRAMMED++;
    }

    printf("PROGRAM FLASH OK (%u phrases)\n", PHRASES_PROGRAMMED);


    /* -------------------------------------------------------------------------- */
    /*                          (7) Verify FLASH                                  */
    /* -------------------------------------------------------------------------- */
    for (uint16_t offset = 0; offset < NVM_FLASH_SIZE_BYTES; offset++)
    {
        uint16_t byte_address = (uint16_t)(NVM_FLASH_START + offset);
        uint8_t  expected     = FLASH_IMAGE[offset];
        uint8_t  actual       = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, byte_address);

        if (actual != expected)
        {
            uint8_t retry = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, byte_address);

            printf("VERIFY FLASH FAILED @0x%04X (expected 0x%02X, read 0x%02X, re-read 0x%02X)\n",
                   byte_address, expected, actual, retry);
            S08_POWER_CYCLE();
            return false;
        }
    }

    printf("VERIFY FLASH OK\n");


