Posting-Up/PICO2-MCU-PROGRAMMER/MC9S08PA4.c
    /* -------------------------------------------------------------------------- */
    /*                          (8) Program EEPROM                                */
    /* -------------------------------------------------------------------------- */
    uint16_t bursts_programmed = 0;

    for (uint16_t offset = 0; offset < NVM_EEPROM_SIZE_BYTES; offset += NVM_EEPROM_BURST_BYTES)
    {
        bool burst_is_erased = true;

        for (uint8_t byte = 0; byte < NVM_EEPROM_BURST_BYTES; byte++)
        {
            if (EEPROM_IMAGE[offset + byte] != NVM_ERASED_BYTE)
            {
                burst_is_erased = false;
                break;
            }
        }

        if (burst_is_erased)
        {
            continue;
        }

        uint16_t address = (uint16_t)(NVM_EEPROM_START + offset);

        FSTAT = S08_PROGRAM_EEPROM_BYTES(address, &EEPROM_IMAGE[offset], (uint8_t)NVM_EEPROM_BURST_BYTES);

        if (FSTAT & NVM_FSTAT_ERR_MASK)
        {
            printf("PROGRAM EEPROM FAILED @0x%04X (FSTAT=0x%02X)\n", address, FSTAT);
            S08_POWER_CYCLE();
            return false;
        }

        bursts_programmed++;
    }

    printf("PROGRAM EEPROM OK (%u bursts)\n", bursts_programmed);


    /* -------------------------------------------------------------------------- */
    /*                          (9) Verify EEPROM                                 */
    /* -------------------------------------------------------------------------- */
    for (uint16_t offset = 0; offset < NVM_EEPROM_SIZE_BYTES; offset++)
    {
        uint16_t byte_address = (uint16_t)(NVM_EEPROM_START + offset);
        uint8_t  expected     = EEPROM_IMAGE[offset];
        uint8_t  actual       = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, byte_address);

        if (actual != expected)
        {
            uint8_t retry = S08_RX_BYTE(TX_BYTE_PIO, TX_BYTE_SM, TX_1_LOW_TIME_SM_CYCLES, TX_1_HIGH_TIME_SM_CYCLES, S08_CMD_READ_BYTE, byte_address);

            printf("VERIFY EEPROM FAILED @0x%04X (expected 0x%02X, read 0x%02X, re-read 0x%02X)\n",
                   byte_address, expected, actual, retry);
            S08_POWER_CYCLE();
            return false;
        }
    }

    printf("VERIFY EEPROM OK\n");


    /* -------------------------------------------------------------------------- */
    /*        (10) Program the Flash Configuration Field to the unsecured state   */
    /* -------------------------------------------------------------------------- */
    const uint8_t config_field[NVM_FLASH_PHRASE_BYTES] =
    {
        NVM_CFG_RESERVED_BYTE,      // 0xFF78 reserved
        NVM_CFG_RESERVED_BYTE,      // 0xFF79 reserved
        NVM_CFG_RESERVED_BYTE,      // 0xFF7A reserved
        NVM_CFG_RESERVED_BYTE,      // 0xFF7B reserved
        NVM_CFG_FPROT_BYTE,         // 0xFF7C flash protection byte
        NVM_CFG_EEPROT_BYTE,        // 0xFF7D EEPROM protection byte
        NVM_CFG_FOPT_BYTE,          // 0xFF7E flash nonvolatile byte
        NVM_CFG_FSEC_UNSECURED      // 0xFF7F flash SECURITY byte
    };

    S08_PROGRAM_FLASH_PHRASE(NVM_CFG_FIELD_START, config_field);


    /* -------------------------------------------------------------------------- */
    /*                        (11) Power Cycle MCU                                */
    /* -------------------------------------------------------------------------- */
    S08_POWER_CYCLE();


    /* -------------------------------------------------------------------------- */
    /*                      (12) PROGRAMMED SUCCESSFULLY                          */
    /* -------------------------------------------------------------------------- */
    return true;
}
